## Plan Result (sbox_shutter_static_webapp)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_resource_group.rg
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;toffee&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;toffee&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;toffee&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "sds-platform-shutter-webapp-rg"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["toffee"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "toffee"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.static_webapp.azurerm_static_site.swebapp["toffee"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "toffee"
      + resource_group_name = "sds-platform-shutter-webapp-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["toffee"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "toffee.sandbox.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "cname-delegation"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":498,"Program":"tfcmt","SHA1":"","Target":"sbox_shutter_static_webapp","Vars":{}} -->